Revit 2027 API
ParameterTypeId.ConnectorProfileType Property
 "Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConnectorProfileType { get; }
Public Shared ReadOnly Property ConnectorProfileType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConnectorProfileType {
	ForgeTypeId^ get ();
}
static member ConnectorProfileType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace